{"id":15980,"date":"2018-03-24T15:00:02","time":"15:00","slug":"the-phenomenal-it-consultant-a-blueprint-to-getting-new-clients-charging-more-and-working-less","title":"The Phenomenal IT Consultant &#8211; A Blueprint to Getting New Clients, Charging More, and Working Less","body":"<p>Whether you are just starting out or have been in business as an IT consultant for a while, if you desire more clients or wonder how to finally achieve success online, you are not alone.</p>\n<p>If you are like most independent consultants, you spend all your waking hours chasing after new clients. But somehow, you just can’t get enough of them to say yes.</p>\n<p>It’s time for a change. Imagine having potential clients call you and demand that you take their money, instead of you calling them and being rejected. Imagine being able to pick and choose who you want to work with instead of having to take on everyone with a wallet. Imagine being able to increase your prices and spend less time working while still growing your income.</p>\n<p>Discover how this is possible: Join Sebastian Meine, Ph.D. for this unique session where he will introduce a simple way to attract new clients to your business: The NICER Client Attraction Method™. </p>\n<p>In this session, you’ll<br />\n• Learn why your current way of finding clients is actually driving them away.<br />\n• Experience ways to stop feeling like the best-kept secret in your field and instead be seen as a sought-after authority.<br />\n• Identify the five steps every client has to take before they will ever pay you. (Ignore them, and you’ll lose a lot of business.)<br />\n• Discover the one thing you can do today that’ll make any conversation with a potential client easy. No more feeling like a used-car salesman. </p>\n<p>So, if you feel like you are treading water when it comes to marketing and growing your business, join this session and get started on your way to becoming a Phenomenal IT Consultant.</p>\n","room":"Cafe","speaker":"Sebastian Meine","badge":""}