[{"id":15886,"date":"2018-03-24T10:00:59","time":"10:00","slug":"build-a-successful-startup","title":"Build a Successful Startup","body":"<p>Do you have an idea or a startup? Don&#8217;t know how and where to start? This session covers from the idea to a successful launch of a startup and how to become successful. </p>\n<p>Agenda:<br />\n1. Validate your idea<br />\n2. Find a co-founder<br />\n3. Build a team<br />\n4. Get an MVP Ready<br />\n5. Prepare a team of beta testers and early adpoters<br />\n6. Validate and refine<br />\n7. Get funding<br />\n8. Build a full-featured product<br />\n9. Build a board<br />\n10. Launch it </p>\n","room":"Cafe","speaker":"Mahesh Chand","badge":"MVP"},{"id":15872,"date":"2018-03-24T10:00:19","time":"10:00","slug":"fault-driven-development","title":"Fault Driven Development","body":"<p>Failure IS an option! Developing cloud-first applications can be fundamentally different than building traditional on-prem applications. As a cloud app developer, you need to be prepared for and expect failures in your code as well as in your app environment. This session will arm you with tools to be proactive with fault tolerance and reactive with fault handling.</p>\n","room":"Strafford","speaker":"Josh Garverick","badge":"MVP"},{"id":15867,"date":"2018-03-24T10:00:19","time":"10:00","slug":"view-components-and-tag-helpers-in-net-core","title":"View Components and Tag Helpers in .NET Core","body":"<p>View Components were a new feature released as part of .NET Core MVC. They are a great way to create reuseable bits of code that are accessible in your MVC applications. I will walk you through code to create a View Component in an external library and consume it using the Tag Helper syntax in an MVC application.</p>\n","room":"Merion","speaker":"Anna Bateman","badge":""},{"id":15964,"date":"2018-03-24T10:00:22","time":"10:00","slug":"fast-neural-networks-a-no-brainer-the-actor-model-as-neuron","title":"Fast Neural Networks&#8230; a no brainer! The Actor model as neuron","body":"<p>Artificial Neural Networks are a fascinating computational approach modeled to react similar to a biological brain to solve problems. Neural networks are a very powerful tool that enable machines to teach and evolve themselves. You can utilize this power in almost any application. Don&#8217;t be intimidated by the equations and Greek symbols of this cutting-edge technology, I will guide you on how to slay this technology and make it bend to your will! In this session, we are going to demystify the presumed complexity of Neural Networks. No need for a PhD or mathematical background, after this overview, you will be discussing these concepts around the water cooler. There will be very little math and lots of coding. The goal is for everyone to become acquainted with Neural Network from a pragmatic standpoint. </p>\n<p>In this session, we will take a closer look at artificial neural networks inspired by biological neurons. We will study how these neurons can be modeled in a digital counterpart. After a short introduction of the actor model, the communalities between neurons and how Actors work by building an asynchronous and reactive neural network will be demonstrated.<br />\nJust when you think it couldn&#8217;t get any better, I will show you how to employ the functional paradigm to leverage multicore machines and GPUs to make your neural network predictions infinitely faster through parallelism. </p>\n<p>By the end of this talk, you will learn the basic concepts of Neural Network and how to apply functional concurrency to estimate future stock prices at smoking fast speeds…and perhaps get rich while practicing!</p>\n","room":"30th Street","speaker":"Riccardo Terrell","badge":"MVP"},{"id":16062,"date":"2018-03-24T10:00:26","time":"10:00","slug":"creating-and-distributing-custom-web-components","title":"Creating and Distributing Custom Web Components","body":"<p>Web components are a simple and powerful way to extend the web. Add my-custom-component tags, sprinkle in some JavaScript, and new functionality springs to life! As developers, how can we create, package, and distribute custom web components in a manner that resonates with others, regardless of their platform and ecosystem choices?</p>\n<p>We&#8217;ll take a simple web component from idea to implementation, effectively and simultaneously targeting vanilla JS all the way to webpack. The highlights include inputs, events, dependency management, polyfill strategies, performance, payload size, managing updates, and more!</p>\n","room":"Berwyn","speaker":"Ken Dale","badge":"MVP"},{"id":15878,"date":"2018-03-24T10:00:30","time":"10:00","slug":"dockerize-an-asp-net-core-2-0-application","title":"Dockerize an ASP.NET Core 2.0 Application","body":"<p>Docker is a tool that can package an application and its dependencies in a virtual container to run on any server. This helps enable flexibility and portability on where the application can run. ASP.NET Core is an open source, cross platform, performant, and scalable web application framework. The modularity and lightweight nature of .NET Core makes it perfect for containers. Today, I am going to give a brief introduction of Docker and show everybody how to run an ASP.NET Core 2.0 Application in Docker containers.</p>\n","room":"Paoli","speaker":"Henry He","badge":""},{"id":15858,"date":"2018-03-24T10:00:35","time":"10:00","slug":"typescript-javascript-evolved-6","title":"TypeScript: JavaScript Evolved","body":"<p>JavaScript is in your browser, your freezer and everywhere in between. Though it&#8217;s true that today&#8217;s world runs on JavaScript, the language was created with form validation and basic DOM manipulation in mind so it leaves a lot to be desired when it comes to writing real-world applications with it. So much so that Douglas Crockford felt the need to write a book entitled, &#8220;JavaScript the Good Parts&#8221; and Anders Hejlsberg, the father of C#, decided to focus his decades of language development expertise into bringing JavaScript into the world of mature, respectable languages by creating TypeScript.</p>\n<p>In this presentation I&#8217;ll show just what TypeScript is, how it relates to the concepts you already know today, and why you would might consider writing all your web applications in TypeScript rather than plain old JavaScript from now on.</p>\n","room":"MPR II","speaker":"Jess Chadwick","badge":"MVP"},{"id":15880,"date":"2018-03-24T10:00:38","time":"10:00","slug":"sharepoint-and-azure-how-to-jump-start-sharepoint-development-fast-and-easy-with-cloud-power-2","title":"SharePoint and Azure &#8211; How to Jump Start SharePoint Development Fast and Easy with Cloud Power!","body":"<p>This presentation shows how to use Azure Virtual Machines for hosting a SharePoint 2013 and 2016 farm in the cloud! We will demo how to get started with Azure using Dev Essentials, a free offering from Microsoft for developers to get started with developing on Azure, and we&#8217;ll show several ways to get a SharePoint farm up and running using the SharePoint farm wizard in Azure. Once we have our SharePoint 2013 farm up and running, we will demo adding an Azure based virtual machine to our SharePoint 2013 farm, and then install SharePoint 2016 on it, to give us both a SharePoint 2013 and 2016 farm in the cloud!</p>\n","room":"Envision","speaker":"David Patrick","badge":""},{"id":15860,"date":"2018-03-24T10:00:51","time":"10:00","slug":"creating-awesome-chat-bots-with-the-bot-framework-and-c","title":"Creating Awesome Chat Bots with the Bot Framework and C#","body":"<p>Microsoft makes it easy to create chat bots with the Bot Framework. They provide the basic building blocks and I&#8217;ll show you how to put it all together and host the bot on your website.</p>\n","room":"Malvern","speaker":"Andy Schwam","badge":"MVP"},{"id":15851,"date":"2018-03-24T10:00:57","time":"10:00","slug":"creating-an-angular-component-library","title":"Creating an Angular Component Library","body":"<p>A practical session on creating a reusable Angular UI Component using TypeScript and the HTML5 Canvas, optimizing its payload size through bundling tools and tree shaking, preparing it for deployment, and using it in an application.</p>\n","room":"MPR I","speaker":"Graham Murray","badge":""},{"id":15811,"date":"2018-03-24T10:00:09","time":"10:00","slug":"the-server-is-dead-going-serverless-to-create-a-highly-scalable-application-you-can-manage","title":"The Server is Dead! Going Serverless to Create a Highly Scalable Application You Can Manage","body":"<p>The Server is Dead! Going Serverless to Create a Highly Scalable Application You Can Manage</p>\n","room":"Wynnewood","speaker":"Chris Love","badge":"MVP"}]