[{"id":15903,"date":"2018-03-24T12:00:25","time":"12:00","slug":"revisiting-the-twelve-factor-cloud-application","title":"Revisiting the Twelve Factor Cloud Application","body":"<p>Do you do cloud development? Are you adhering to the 12 factors (https://12factor.net/)? Cloud applications are ubiquitous now, and it is easy to miss the factors that make them truly cloud native. In this session, lets revisit the 12 factors with some practical examples using a CloudFoundry application.</p>\n","room":"Wynnewood","speaker":"Ravi Okade","badge":""},{"id":15905,"date":"2018-03-24T12:00:32","time":"12:00","slug":"graphs-theory-love-and-data-storage","title":"Graphs: Theory, Love, and Data Storage","body":"<p>Everything is connected, from our microscopic brain neurons to the grandiose universe wherein all bodies of mass are pulled towards each other in a graph of gravitation.</p>\n<p>In a fashion as structured as graphs themselves, we&#8217;ll use my deep love for graphs as a catalyst for the exploration, understanding, and usage of these highly-useful structures. We&#8217;ll start off with an introduction to what graphs are, how we can work with them, and what &#8216;graph theory&#8217; is. From there, we&#8217;ll delve into usage within programming languages of several paradigms, including JavaScript, F#, and C#. Finally, we&#8217;ll look at graphs as an effective way to store real business data and the benefits that this path lends itself to.</p>\n","room":"Strafford","speaker":"Stachu Korick","badge":""},{"id":15913,"date":"2018-03-24T12:00:41","time":"12:00","slug":"building-a-better-data-solution-microsoft-sql-server-and-azure-data-services","title":"Building a better data solution: Microsoft SQL Server and Azure Data Services","body":"<p>Moving to the cloud in a big way? In this case study, learn about building a complex end-to-end infrastructure involving SQL Server (on-premises), Microsoft Azure SQL Data Warehouse, and Azure SQL Database. Gain an understanding of how to use Azure Automation to reduce your costs and automate processes. Learn about integration with Azure Active Directory, virtual networks, and data flows.</p>\n","room":"Envision","speaker":"Joseph Dantoni","badge":"MVP"},{"id":15907,"date":"2018-03-24T12:00:23","time":"12:00","slug":"serverless-powershell-azure-functions","title":"Serverless PowerShell Azure Functions","body":"<p>Serverless PowerShell Azure Functions. Serverless means reduced DevOps, reduced complexity, and broader reach. Stay focused on what you need to deliver. Have you ever built a PowerShell script and wanted to share it? Do you post it to a network drive? Submit it to an internal system to have it delivered? Want to distribute it more broadly, or serve up your PowerShell function as a REST API? Check this out!</p>\n","room":"Paoli","speaker":"Doug Finke","badge":"MVP"},{"id":15910,"date":"2018-03-24T12:00:10","time":"12:00","slug":"who-needs-visual-studio-a-look-at-net-core-on-linux-and-visual-studio-code","title":"Who needs Visual Studio? A look at .NET Core on Linux and Visual Studio Code","body":"<p>.NET Core promises to remove the shackles from Windows and Visual Studio! How does this all work with .NET Core 2.0? What does the development process look like and can you really use a Linux desktop as your daily development driver?</p>\n<p>Most of us are going to let Visual Studio do the heavy lifting, and that&#8217;s fine, but in this session, we&#8217;ll put the IDE aside and work with .NET Core more directly. We&#8217;ll install the .NET Core SDK, create some apps with the dotnet CLI and get them running in Linux and on a few Azure services as well.</p>\n<p>This session is perfect for .NET veterans who are brand new to .NET Core and want to see what the brave new world looks and feels like. It&#8217;s okay if you&#8217;re unfamiliar with Linux, but are interested in having options available to you. And if you&#8217;re curious what the development experience is like in Visual Studio Code, this session is for you.</p>\n","room":"Berwyn","speaker":"Chris Gomez","badge":"MVP"}]