[
    {
        "id": 15975,
        "date": "2018-03-24T15:00:59",
        "time": "15:00",
        "slug": "facial-recognition-in-dotnet-face-registry-application",
        "title": "Facial Recognition in dotNet &#8211; Face Registry Application",
        "body": "<p>Add Facial recognition to (*any) dotNet App (including Asp.NET MVC)<br />\nI walk you through the concepts and processes required to &#8220;Register&#8221; People into Microsoft&#8217;s Azure Cognitive Services Face API. </p>\n<p>By the end of the session we will have a working Classic Forms (UWP app is currently in development) application with a website interface for processing.<br />\nwe develop a client library for use in many application types including ASP.NET application giving you a method to install MFA in a web app. (it sounds funny but we will go over why and how this is possible)</p>\n<p>As a bonus, I include a secure integration of KeePass 2.38 for Key and secure storage. if time allows we will go over this implementation and why its important.</p>\n<p>Note: We are dependent on the available version of the Microsoft.ProjectOxford NuGet packages. these packages are not available for all dotNet application types. what i&#8217;m presenting is two methods, an HTTP Client interface where you build all the calls yourself (Explained in short and at the start to give those who are interested in NON-dotNet dev an access point) and the Microsoft.ProjectOxford NuGet Packages where the HTTP Client interfacing and json object POCO classes.</p>\n",
        "room": "Berwyn",
        "speaker": "Marcus Kern",
        "badge": ""
    },
    {
        "id": 15971,
        "date": "2018-03-24T15:00:50",
        "time": "15:00",
        "slug": "developing-lorawan-with-azure-iot",
        "title": "Developing LoRaWan with Azure IoT",
        "body": "<p>Hands on Demo on connecting LoRa Sensors to Azure IoT</p>\n",
        "room": "Paoli",
        "speaker": "Yash Chabria",
        "badge": ""
    },
    {
        "id": 15956,
        "date": "2018-03-24T15:00:43",
        "time": "15:00",
        "slug": "cross-platform-web-apps-with-asp-net-core",
        "title": "Cross-platform web apps with ASP .NET Core",
        "body": "<p>Whether you’re developing on PC, Mac or Linux, learn how you can use Visual Studio Code on your development platform of choice and deploy to the cloud with ease. Get busy with the full-featured Visual Studio for Windows or the all-new Visual Studio for Mac. Start your project on a Mac, add new developers on Windows and deploy to Linux on Microsoft Azure. Pick and choose one of many ways of developing cross-platform web apps with the all-new open-source ASP .NET Core 2.1!</p>\n<p>Join Microsoft Sr. Technical Evangelist and CSE Engineer Shahed Chowdhuri in a fun and engaging session of web app development!</p>\n",
        "room": "MPR II",
        "speaker": "Shahed Chowdhuri",
        "badge": "MS"
    },
    {
        "id": 15954,
        "date": "2018-03-24T15:00:39",
        "time": "15:00",
        "slug": "introduction-to-react-native-with-redux",
        "title": "Introduction to React Native with Redux",
        "body": "<p>This session will go the high level details of React, a JavaScript user interface library currently maintained by Facebook. Not only can React be used to build progressive web applications (PWAs), but it also can be used to create native iOS/Android applications using React Native. </p>\n<p>Basic concepts of React Native will be covered, such as components, props and state. Advanced topics will also be covered, such as React Navigation and state management Redux (using middleware.) The goal of the session is to build an Android app that can connect to an outside API.</p>\n",
        "room": "MPR I",
        "speaker": "Mike Melusky",
        "badge": ""
    },
    {
        "id": 16068,
        "date": "2018-03-24T15:00:39",
        "time": "15:00",
        "slug": "sitecore-cms-experience-platform",
        "title": "Sitecore CMS Experience Platform",
        "body": "<p>Sitecore customer experience management software contains state-of-the-art CMS and marketing functionality that gives you complete control over the great customer experience that you give to your customers. It allows you to unify all your activity across multiple channels, from campaigns to visitor activity to performance measurement.</p>\n",
        "room": "Strafford",
        "speaker": "Garrett Schneider",
        "badge": ""
    },
    {
        "id": 15966,
        "date": "2018-03-24T15:00:28",
        "time": "15:00",
        "slug": "thinking-outside-the-box-leveraging-unix-tools-gnu-for-data-analysis-and-validation",
        "title": "Thinking outside the box: Leveraging &#8220;UNIX Tools&#8221; (GNU) for Data Analysis and Validation",
        "body": "<p>Life would be so much easier if everything was in a database or pulled via API. But that is not the case. All too often we get data files (or have to send them) in various formats. This session discusses some of the tools available to help you figure out what the file looks like so you can pull it apart using those tools or your tool-of-preference. While the GNU version of these tools will be the focus, the skills learned apply to many different platforms. Being available on so many platforms gives you lots of choices. Your choices include Microsoft’s Bash under Windows 10, Cygwin under many Microsoft Windows versions, MAC OSX, the Linux core of Android, commercial Linux — like Red Hat Enterprise, and commercial UNIX — like IBM’s AIX or Sun/Oracle’s Solaris.</p>\n<p>Of particular interest are ‘head’, ‘tail’, ‘wc’, ‘awk’, ‘dd conv’, and shells.</p>\n<p>A few of the differences between UNIX/Linux and Windows will also be discussed to ease your shifts in our heterogeneous environments. This knowledge also comes in handy if you need to migrate code from an existing UNIX/Linux-based application.</p>\n",
        "room": "Wynnewood",
        "speaker": "David Horvath",
        "badge": ""
    },
    {
        "id": 15968,
        "date": "2018-03-24T15:00:24",
        "time": "15:00",
        "slug": "unblocking-blockchain",
        "title": "Unblocking Blockchain",
        "body": "<p>Blockchain is one of the most talked technologies of year 2017 and 2018. This session covers basics of blockchain, who do we need it, how it works, and how developers can get started with it.</p>\n",
        "room": "30th Street",
        "speaker": "Mahesh Chand",
        "badge": "MVP"
    },
    {
        "id": 15960,
        "date": "2018-03-24T15:00:19",
        "time": "15:00",
        "slug": "dropping-frames-creating-video-content-for-developers",
        "title": "Dropping Frames: Creating Video Content for Developers",
        "body": "<p>Video is quickly becoming the preferred medium of learning for many software developers. Some look to recorded video tutorials on YouTube or subscription sites like Pluralsight. Others enjoy watching live coding sessions on Twitch or Mixer. Over the past year and a half at Twilio I focused on creating developer content both for Twitch and YouTube and significantly increased our subscriber base. Come and learn how to get started creating your own video content. You’ll see different tools and equipment in action as well as learn tips and tricks on how to get the most out of these video platforms.</p>\n",
        "room": "Malvern",
        "speaker": "Brent Schooley",
        "badge": "MVP"
    },
    {
        "id": 15962,
        "date": "2018-03-24T15:00:19",
        "time": "15:00",
        "slug": "stress-free-deployments-with-octopus-deploy-3",
        "title": "Stress Free Deployments with Octopus Deploy",
        "body": "<p>Deployment can be a real headache but it doesn’t have to be. You can and should make your life easier by automating your builds to reduce risk and stress. Octopus Deploy is a great tool and easy to use. In this demo, I’ll get you up to speed so you can start using Octopus Deploy to deploy .Net Applications. We’ll cover setting up Octopus, integrating with TFS (or other build servers), and deploying applications.</p>\n",
        "room": "Merion",
        "speaker": "Andy Schwam",
        "badge": "MVP"
    },
    {
        "id": 15978,
        "date": "2018-03-24T15:00:06",
        "time": "15:00",
        "slug": "azure-patterns-for-architects-and-devs-service-bus-and-cdn",
        "title": "Azure Patterns for Architects and Devs: Service Bus and CDN",
        "body": "<p>There are so many Azure features and patterns out there, where should you start? Becoming familiar with Azure takes natural path of IaaS VMs, then Web Apps, then new patterns involving Service Bus and CDN. In this session, I will focus specifically on Azure Service Bus, Azure Relay, Azure CDN, and wrap up with an overall architecture showing them and more.</p>\n",
        "room": "Envision",
        "speaker": "Tim Ferro",
        "badge": "MVP"
    },
    {
        "id": 15980,
        "date": "2018-03-24T15:00:02",
        "time": "15:00",
        "slug": "the-phenomenal-it-consultant-a-blueprint-to-getting-new-clients-charging-more-and-working-less",
        "title": "The Phenomenal IT Consultant &#8211; A Blueprint to Getting New Clients, Charging More, and Working Less",
        "body": "<p>Whether you are just starting out or have been in business as an IT consultant for a while, if you desire more clients or wonder how to finally achieve success online, you are not alone.</p>\n<p>If you are like most independent consultants, you spend all your waking hours chasing after new clients. But somehow, you just can’t get enough of them to say yes.</p>\n<p>It’s time for a change. Imagine having potential clients call you and demand that you take their money, instead of you calling them and being rejected. Imagine being able to pick and choose who you want to work with instead of having to take on everyone with a wallet. Imagine being able to increase your prices and spend less time working while still growing your income.</p>\n<p>Discover how this is possible: Join Sebastian Meine, Ph.D. for this unique session where he will introduce a simple way to attract new clients to your business: The NICER Client Attraction Method™. </p>\n<p>In this session, you’ll<br />\n• Learn why your current way of finding clients is actually driving them away.<br />\n• Experience ways to stop feeling like the best-kept secret in your field and instead be seen as a sought-after authority.<br />\n• Identify the five steps every client has to take before they will ever pay you. (Ignore them, and you’ll lose a lot of business.)<br />\n• Discover the one thing you can do today that’ll make any conversation with a potential client easy. No more feeling like a used-car salesman. </p>\n<p>So, if you feel like you are treading water when it comes to marketing and growing your business, join this session and get started on your way to becoming a Phenomenal IT Consultant.</p>\n",
        "room": "Cafe",
        "speaker": "Sebastian Meine",
        "badge": ""
    },
    {
        "id": 15919,
        "date": "2018-03-24T13:30:59",
        "time": "13:30",
        "slug": "streaming-your-user-group-or-coding-live",
        "title": "Streaming Your User Group or Coding Live",
        "body": "<p>Video streaming took off when video gamers started plying their craft, with platforms dedicated to low latency, high quality video on demand and live.</p>\n<p>This format is perfect to extend the reach of user groups and meetups beyond those who attend in person. Philly.NET and Philly Azure are streaming every event in 2018. And live streaming your work on the desktop at home is a convenient way to get feedback and &#8220;pair program&#8221; with the world.</p>\n<p>In this session, Chris Gomez and Rich Ross will tell you how they got started streaming Philly.NET and Philly Azure events. The stream improves each month with new features being added.</p>\n<p>Chris and Rich have plenty of tips for getting started with free software and services. We&#8217;ll also show you the hardware we&#8217;ve used and some of the lessons learned on what to be prepared for. Start small and over time you can make your stream more &#8220;professional&#8221;. </p>\n<p>2018 will be the year you see more streams of events and developers at home sharing their skills and learning from each other. This is the time to grow your community in a new and exciting way. Learn how to get involved!</p>\n",
        "room": "Malvern",
        "speaker": "Chris Gomez",
        "badge": "MVP"
    },
    {
        "id": 15917,
        "date": "2018-03-24T13:30:52",
        "time": "13:30",
        "slug": "intro-to-razor-pages-2",
        "title": "Intro to Razor Pages",
        "body": "<p>The release of http://ASP.NET Core 2.0 introduces Razor Pages – an alternate web development approach that sits on top of http://ASP.NET Core MVC and brings a simplified, page-based web development model to the .NET Core ecosystem.</p>\n<p>In this session I’ll show you how the framework works, how it relates to http://ASP.NET Core MVC and how/when you can begin using it today, even in your existing http://ASP.NET Core MVC projects. Then we’ll talk about when and why you might want to use Razor Pages, when you might want to use http://ASP.NET Core MVC… or when you might want to use both!</p>\n",
        "room": "MPR II",
        "speaker": "Jess Chadwick",
        "badge": "MVP"
    },
    {
        "id": 15939,
        "date": "2018-03-24T13:30:52",
        "time": "13:30",
        "slug": "devops-more-than-automation",
        "title": "DevOps &#8211; More than Automation",
        "body": "<p>DevOps means different things to different people. Many organizations see DevOps as build automation, server administration or release management. In other people&#8217;s view, it is IT Operations. All of this is true, however, DevOps is much more. In this talk, we will discuss the full meaning of DevOps &#8211; People, Process and Tooling. Introducing DevOps to an organization addresses cultural changes, process improvement along with tooling. We will also show how Visual Studio Team Services (VSTS) and Azure are designed with DevOps in mind. Come and share your experiences and learn from one another.</p>\n",
        "room": "Paoli",
        "speaker": "Brian Minisi",
        "badge": "MVP"
    },
    {
        "id": 15925,
        "date": "2018-03-24T13:30:40",
        "time": "13:30",
        "slug": "welcome-to-the-age-of-conversational-interfaces",
        "title": "WELCOME TO THE AGE OF CONVERSATIONAL INTERFACES!",
        "body": "<p>In the age of conversational interfaces, users are increasingly expecting to interact with applications in a flexible and contextualised way. They also expect to interact with the app via multiple communication channels such as SMS, voice and lately bots. In this talk, we will go through programmable and contextual communications, why it’s a key element of apps development in the present and future? We will also learn how to add feature rich communications capabilities to your apps using Microsoft Bot Framework and Nexmo SMS and Voice APIs.</p>\n",
        "room": "Merion",
        "speaker": "Rabeb Othmani",
        "badge": ""
    },
    {
        "id": 15984,
        "date": "2018-03-24T13:30:35",
        "time": "13:30",
        "slug": "living-on-the-edge-with-web-assembly-blazor-and-c",
        "title": "Living on the Edge with Web Assembly (Blazor and C#)",
        "body": "<p>A peek into the future of web development, what the heck is Web Assembly and why should developers care!. With the introduction of Microsoft experimental web UI framework Blazor its now possible to harness your C#/.Net Skills to build full blown Web Assembly applications. Come learn and discuss the future of web development.</p>\n",
        "room": "30th Street",
        "speaker": "Todd Snyder",
        "badge": ""
    },
    {
        "id": 15951,
        "date": "2018-03-24T13:30:32",
        "time": "13:30",
        "slug": "lets-talk-about-getting-a-job",
        "title": "Let&#8217;s talk about getting a job",
        "body": "<p>In this session we will discuss what it takes to get a new position. This will be an open Q&#038;A session. We will discuss the research and learnings over the last 20 years such as resumes, interviews, calling, and what to do when you don&#8217;t know what to do. Come and let&#8217;s chat.</p>\n",
        "room": "Cafe",
        "speaker": "Anthony Verguldi",
        "badge": ""
    },
    {
        "id": 15935,
        "date": "2018-03-24T13:30:23",
        "time": "13:30",
        "slug": "megahertz-gigahertz-registers-and-instructions-how-does-a-cpu-actually-work",
        "title": "Megahertz, Gigahertz, Registers and Instructions: How does a CPU actually work?",
        "body": "<p>For decades, we’ve been creating ever higher abstractions between ourselves and the computing hardware we’re programming, but in the end whether you’re writing JavaScript, Haskell, or Python it all comes down to 1’s and 0’s running through hardware patterns that were well understood twenty years ago.</p>\n<p>We’ll walk through the fundamentals of how CPU’s “think” in an accessible way (no engineering degree required!) so you can appreciate the marvel that is the modern CPU be it in a server data center or your fridge at home. You’ll learn how a CPU turns the code we feed it into actions, what’s the big difference between an ARM and an Intel processor, how CPU’s constantly optimize work for us, and where is it all going for the next few years.</p>\n<p>Finally, we&#8217;ll show how Meltdown and Spectre take advantage of CPU internals to expose data and why this class of security problems are going to be a challenge to the next generation of CPU&#8217;s.</p>\n",
        "room": "Strafford",
        "speaker": "Kendall Miller",
        "badge": ""
    },
    {
        "id": 15943,
        "date": "2018-03-24T13:30:19",
        "time": "13:30",
        "slug": "xml-and-json-technologies-within-sql-server",
        "title": "XML and JSON technologies within SQL Server",
        "body": "<p>This session explains internal SQL Server XML processes and demonstrates how XML shredding could help to solve issues, speed up daily performance monitoring and detect problems. The difference between XML and JSON will be demonstrated, with an in-depth look at the SQL Server &#8211; JSON integration. During the session, the audience will be provided with plenty of code examples. As a bonus, a lucky winner will receive my most recent book, &#8220;XML and JSON Recipes for SQL Server&#8221;.</p>\n",
        "room": "Berwyn",
        "speaker": "Alex Grinberg",
        "badge": ""
    },
    {
        "id": 15915,
        "date": "2018-03-24T13:30:10",
        "time": "13:30",
        "slug": "creating-a-progressive-web-application-pwa-from-scratch-to-engaging-app",
        "title": "Creating a Progressive Web Application (PWA) From Scratch to Engaging App",
        "body": "<p>Progressive Web Apps are the new hot thing all the browsers are pushing and businesses want. They combine maximum customer reach with platform integrations previous reserved to native apps. </p>\n<p>Progressive web apps have technical requirements of HTTPS, a valid web manifest and a registered service worker. As usual things are not as simple as they seem. </p>\n<p>This session demonstrates how you can create a simple progressive web app in under an hour. You will learn how to quickly create a minimum progressive web app and then apply some intermediate techniques to improve the application&#8217;s performance and user experience. </p>\n<p>The goal is to learn how you can adjust traditional web site architecture to be a proper PWA that you can take back and upgrade new and existing web sites to be a good progressive web app.</p>\n",
        "room": "MPR I",
        "speaker": "Chris Love",
        "badge": "MVP"
    },
    {
        "id": 15931,
        "date": "2018-03-24T13:30:08",
        "time": "13:30",
        "slug": "sql-server-indexing-for-developers-and-accidental-dbas",
        "title": "SQL Server Indexing for Developers and Accidental DBAs",
        "body": "<p>So you have been tasked with making that query faster. You know that indexes often can help with query performance, but how do you even start going about it.</p>\n<p>Join Sebastian Meine, Ph.D. for this truly interactive session and discover how indexes in SQL Server work. After attending, you’ll be able to answer common index questions, like:</p>\n<p>&#8211; Which columns should I add to my index?<br />\n&#8211; How many indexes should I add to my new table?<br />\n&#8211; Does the column order in my index have to match that in my query?<br />\n&#8211; Does it hurt to have too many indexes?<br />\n&#8211; When should I consolidate Indexes?<br />\n&#8211; Are there queries that get slower after I create an index?</p>\n<p>But even more important, you’ll be able to explain how indexes are organized in SQL Server and what mechanism is responsible for the amazing performance gains you can achieve with them.</p>\n<p>Don’t miss this unique session. Attend, and you might just turn into an indexing superstar.</p>\n",
        "room": "Wynnewood",
        "speaker": "Sebastian Meine",
        "badge": ""
    },
    {
        "id": 15947,
        "date": "2018-03-24T13:30:06",
        "time": "13:30",
        "slug": "powerapps-flow-and-sharepoint-lists-how-to-build-a-better-interface",
        "title": "PowerApps, Flow and SharePoint Lists: How to Build a Better Interface",
        "body": "<p>PowerApps and Flow offer a quick (and easy?) way of creating new interfaces into SharePoint Online. We&#8217;ll discuss and walk-through a couple different ways to create a new interface into a SharePoint list, apply a Flow to the list, resulting in a new process to work with the information in that SharePoint list.</p>\n",
        "room": "Envision",
        "speaker": "Michael Mukalian",
        "badge": "MS"
    },
    {
        "id": 15913,
        "date": "2018-03-24T12:00:41",
        "time": "12:00",
        "slug": "building-a-better-data-solution-microsoft-sql-server-and-azure-data-services",
        "title": "Building a better data solution: Microsoft SQL Server and Azure Data Services",
        "body": "<p>Moving to the cloud in a big way? In this case study, learn about building a complex end-to-end infrastructure involving SQL Server (on-premises), Microsoft Azure SQL Data Warehouse, and Azure SQL Database. Gain an understanding of how to use Azure Automation to reduce your costs and automate processes. Learn about integration with Azure Active Directory, virtual networks, and data flows.</p>\n",
        "room": "Envision",
        "speaker": "Joseph Dantoni",
        "badge": "MVP"
    },
    {
        "id": 15905,
        "date": "2018-03-24T12:00:32",
        "time": "12:00",
        "slug": "graphs-theory-love-and-data-storage",
        "title": "Graphs: Theory, Love, and Data Storage",
        "body": "<p>Everything is connected, from our microscopic brain neurons to the grandiose universe wherein all bodies of mass are pulled towards each other in a graph of gravitation.</p>\n<p>In a fashion as structured as graphs themselves, we&#8217;ll use my deep love for graphs as a catalyst for the exploration, understanding, and usage of these highly-useful structures. We&#8217;ll start off with an introduction to what graphs are, how we can work with them, and what &#8216;graph theory&#8217; is. From there, we&#8217;ll delve into usage within programming languages of several paradigms, including JavaScript, F#, and C#. Finally, we&#8217;ll look at graphs as an effective way to store real business data and the benefits that this path lends itself to.</p>\n",
        "room": "Strafford",
        "speaker": "Stachu Korick",
        "badge": ""
    },
    {
        "id": 15903,
        "date": "2018-03-24T12:00:25",
        "time": "12:00",
        "slug": "revisiting-the-twelve-factor-cloud-application",
        "title": "Revisiting the Twelve Factor Cloud Application",
        "body": "<p>Do you do cloud development? Are you adhering to the 12 factors (https://12factor.net/)? Cloud applications are ubiquitous now, and it is easy to miss the factors that make them truly cloud native. In this session, lets revisit the 12 factors with some practical examples using a CloudFoundry application.</p>\n",
        "room": "Wynnewood",
        "speaker": "Ravi Okade",
        "badge": ""
    },
    {
        "id": 15907,
        "date": "2018-03-24T12:00:23",
        "time": "12:00",
        "slug": "serverless-powershell-azure-functions",
        "title": "Serverless PowerShell Azure Functions",
        "body": "<p>Serverless PowerShell Azure Functions. Serverless means reduced DevOps, reduced complexity, and broader reach. Stay focused on what you need to deliver. Have you ever built a PowerShell script and wanted to share it? Do you post it to a network drive? Submit it to an internal system to have it delivered? Want to distribute it more broadly, or serve up your PowerShell function as a REST API? Check this out!</p>\n",
        "room": "Paoli",
        "speaker": "Doug Finke",
        "badge": "MVP"
    },
    {
        "id": 15910,
        "date": "2018-03-24T12:00:10",
        "time": "12:00",
        "slug": "who-needs-visual-studio-a-look-at-net-core-on-linux-and-visual-studio-code",
        "title": "Who needs Visual Studio? A look at .NET Core on Linux and Visual Studio Code",
        "body": "<p>.NET Core promises to remove the shackles from Windows and Visual Studio! How does this all work with .NET Core 2.0? What does the development process look like and can you really use a Linux desktop as your daily development driver?</p>\n<p>Most of us are going to let Visual Studio do the heavy lifting, and that&#8217;s fine, but in this session, we&#8217;ll put the IDE aside and work with .NET Core more directly. We&#8217;ll install the .NET Core SDK, create some apps with the dotnet CLI and get them running in Linux and on a few Azure services as well.</p>\n<p>This session is perfect for .NET veterans who are brand new to .NET Core and want to see what the brave new world looks and feels like. It&#8217;s okay if you&#8217;re unfamiliar with Linux, but are interested in having options available to you. And if you&#8217;re curious what the development experience is like in Visual Studio Code, this session is for you.</p>\n",
        "room": "Berwyn",
        "speaker": "Chris Gomez",
        "badge": "MVP"
    },
    {
        "id": 15894,
        "date": "2018-03-24T11:30:50",
        "time": "11:30",
        "slug": "cloud-backed-mixed-reality",
        "title": "Cloud-Backed Mixed Reality",
        "body": "<p>In a modern world of cloud computing and virtual reality experiences, see how Mixed Reality from Microsoft intersects with the real world while connected to various cloud services in Azure. Learn you can get started with HoloLens and the all-new Windows Mixed Reality immersive headsets, while leveraging your reusable skills in C#, Visual Studio, Azure and Cognitive Services.</p>\n",
        "room": "Malvern",
        "speaker": "Shahed Chowdhuri",
        "badge": "MS"
    },
    {
        "id": 15900,
        "date": "2018-03-24T11:30:45",
        "time": "11:30",
        "slug": "go-serverless-with-azure-functions-logic-apps-and-eventgrid",
        "title": "Go Serverless with Azure Functions, Logic Apps and EventGrid",
        "body": "<p>Azure’s serverless story makes it dead simple to decompose your clunky monolithic apps into performant DevOps-friendly microservices. Join Microsoft Cloud Solutions Architect Louis Berman as he shows you how to build and deploy a significant cloud-scale application by live-coding a real-world example of automating employee on-boarding to the Microsoft Graph as a serverless app. As a bonus he’ll also show you how to get a handle on your serverless workloads through DevOps.</p>\n",
        "room": "30th Street",
        "speaker": "Louis Berman",
        "badge": "MS"
    },
    {
        "id": 15890,
        "date": "2018-03-24T11:30:23",
        "time": "11:30",
        "slug": "getting-pushy-with-signalr-and-reactive-extensions-2",
        "title": "Getting pushy with SignalR and Reactive Extensions",
        "body": "<p>As our systems increasingly demand more real-time updates, we need better ways of working with these live streams of information. Traditional pull models fail to provide the real-time responsiveness and scale needs that modern systems expect. Moving to a push model allows us to scale easier and react to new data as it becomes available. SignalR facilitates push notifications over HTTP to a variety of clients. The Reactive Extensions were designed to allow for asynchronous LINQ over push based collections. In this talk, you’ll see how the synergy of these two technologies merge to make otherwise difficult tasks, a push over.</p>\n",
        "room": "MPR II",
        "speaker": "Jim Wooley",
        "badge": "MVP"
    },
    {
        "id": 15898,
        "date": "2018-03-24T11:30:20",
        "time": "11:30",
        "slug": "zen-and-the-art-of-programming-2",
        "title": "Zen and the Art of Programming",
        "body": "<p>Although software development is taught as a STEM out of Science or Engineering schools, it is as much an art or craft a creative process as a science. This presentation focuses on innovative problem solving techniques – the tools and techniques to use when your normal process just doesn’t seem to get you to a solution. Much of the information in this talk is based on Robert Pirsig’s Zen and the Art of Motorcycle Maintenance, which, although it is focusing on Motorcycles, applies to all kinds of problem spaces (and Pirsig was a tech writer for IBM). These techniques have served me well over the years. The difference in art versus science approaches is actually supported by the way the brain works. The talk will cover such areas as:<br />\n* Traditional Problem Solving Methods, where they fall down<br />\n* Eastern techniques, advantages, disadvantages<br />\n* General Tips and how they apply in specific examples<br />\n* Brain versus Mind</p>\n",
        "room": "Merion",
        "speaker": "David Horvath",
        "badge": ""
    },
    {
        "id": 15888,
        "date": "2018-03-24T11:30:16",
        "time": "11:30",
        "slug": "optimizing-reactjs",
        "title": "Optimizing ReactJS",
        "body": "<p>ReactJS is a powerful library that makes it easy to build, reason about, and organize HTML user interfaces. In this session, we&#8217;ll build a single page ReactJS app, peer under the hood at how ReactJS behaves, and learn how to optimize for performance.</p>\n",
        "room": "MPR I",
        "speaker": "Scott Kay",
        "badge": ""
    },
    {
        "id": 15886,
        "date": "2018-03-24T10:00:59",
        "time": "10:00",
        "slug": "build-a-successful-startup",
        "title": "Build a Successful Startup",
        "body": "<p>Do you have an idea or a startup? Don&#8217;t know how and where to start? This session covers from the idea to a successful launch of a startup and how to become successful. </p>\n<p>Agenda:<br />\n1. Validate your idea<br />\n2. Find a co-founder<br />\n3. Build a team<br />\n4. Get an MVP Ready<br />\n5. Prepare a team of beta testers and early adpoters<br />\n6. Validate and refine<br />\n7. Get funding<br />\n8. Build a full-featured product<br />\n9. Build a board<br />\n10. Launch it </p>\n",
        "room": "Cafe",
        "speaker": "Mahesh Chand",
        "badge": "MVP"
    },
    {
        "id": 15851,
        "date": "2018-03-24T10:00:57",
        "time": "10:00",
        "slug": "creating-an-angular-component-library",
        "title": "Creating an Angular Component Library",
        "body": "<p>A practical session on creating a reusable Angular UI Component using TypeScript and the HTML5 Canvas, optimizing its payload size through bundling tools and tree shaking, preparing it for deployment, and using it in an application.</p>\n",
        "room": "MPR I",
        "speaker": "Graham Murray",
        "badge": ""
    },
    {
        "id": 15860,
        "date": "2018-03-24T10:00:51",
        "time": "10:00",
        "slug": "creating-awesome-chat-bots-with-the-bot-framework-and-c",
        "title": "Creating Awesome Chat Bots with the Bot Framework and C#",
        "body": "<p>Microsoft makes it easy to create chat bots with the Bot Framework. They provide the basic building blocks and I&#8217;ll show you how to put it all together and host the bot on your website.</p>\n",
        "room": "Malvern",
        "speaker": "Andy Schwam",
        "badge": "MVP"
    },
    {
        "id": 15880,
        "date": "2018-03-24T10:00:38",
        "time": "10:00",
        "slug": "sharepoint-and-azure-how-to-jump-start-sharepoint-development-fast-and-easy-with-cloud-power-2",
        "title": "SharePoint and Azure &#8211; How to Jump Start SharePoint Development Fast and Easy with Cloud Power!",
        "body": "<p>This presentation shows how to use Azure Virtual Machines for hosting a SharePoint 2013 and 2016 farm in the cloud! We will demo how to get started with Azure using Dev Essentials, a free offering from Microsoft for developers to get started with developing on Azure, and we&#8217;ll show several ways to get a SharePoint farm up and running using the SharePoint farm wizard in Azure. Once we have our SharePoint 2013 farm up and running, we will demo adding an Azure based virtual machine to our SharePoint 2013 farm, and then install SharePoint 2016 on it, to give us both a SharePoint 2013 and 2016 farm in the cloud!</p>\n",
        "room": "Envision",
        "speaker": "David Patrick",
        "badge": ""
    },
    {
        "id": 15858,
        "date": "2018-03-24T10:00:35",
        "time": "10:00",
        "slug": "typescript-javascript-evolved-6",
        "title": "TypeScript: JavaScript Evolved",
        "body": "<p>JavaScript is in your browser, your freezer and everywhere in between. Though it&#8217;s true that today&#8217;s world runs on JavaScript, the language was created with form validation and basic DOM manipulation in mind so it leaves a lot to be desired when it comes to writing real-world applications with it. So much so that Douglas Crockford felt the need to write a book entitled, &#8220;JavaScript the Good Parts&#8221; and Anders Hejlsberg, the father of C#, decided to focus his decades of language development expertise into bringing JavaScript into the world of mature, respectable languages by creating TypeScript.</p>\n<p>In this presentation I&#8217;ll show just what TypeScript is, how it relates to the concepts you already know today, and why you would might consider writing all your web applications in TypeScript rather than plain old JavaScript from now on.</p>\n",
        "room": "MPR II",
        "speaker": "Jess Chadwick",
        "badge": "MVP"
    },
    {
        "id": 15878,
        "date": "2018-03-24T10:00:30",
        "time": "10:00",
        "slug": "dockerize-an-asp-net-core-2-0-application",
        "title": "Dockerize an ASP.NET Core 2.0 Application",
        "body": "<p>Docker is a tool that can package an application and its dependencies in a virtual container to run on any server. This helps enable flexibility and portability on where the application can run. ASP.NET Core is an open source, cross platform, performant, and scalable web application framework. The modularity and lightweight nature of .NET Core makes it perfect for containers. Today, I am going to give a brief introduction of Docker and show everybody how to run an ASP.NET Core 2.0 Application in Docker containers.</p>\n",
        "room": "Paoli",
        "speaker": "Henry He",
        "badge": ""
    },
    {
        "id": 16062,
        "date": "2018-03-24T10:00:26",
        "time": "10:00",
        "slug": "creating-and-distributing-custom-web-components",
        "title": "Creating and Distributing Custom Web Components",
        "body": "<p>Web components are a simple and powerful way to extend the web. Add my-custom-component tags, sprinkle in some JavaScript, and new functionality springs to life! As developers, how can we create, package, and distribute custom web components in a manner that resonates with others, regardless of their platform and ecosystem choices?</p>\n<p>We&#8217;ll take a simple web component from idea to implementation, effectively and simultaneously targeting vanilla JS all the way to webpack. The highlights include inputs, events, dependency management, polyfill strategies, performance, payload size, managing updates, and more!</p>\n",
        "room": "Berwyn",
        "speaker": "Ken Dale",
        "badge": "MVP"
    },
    {
        "id": 15964,
        "date": "2018-03-24T10:00:22",
        "time": "10:00",
        "slug": "fast-neural-networks-a-no-brainer-the-actor-model-as-neuron",
        "title": "Fast Neural Networks&#8230; a no brainer! The Actor model as neuron",
        "body": "<p>Artificial Neural Networks are a fascinating computational approach modeled to react similar to a biological brain to solve problems. Neural networks are a very powerful tool that enable machines to teach and evolve themselves. You can utilize this power in almost any application. Don&#8217;t be intimidated by the equations and Greek symbols of this cutting-edge technology, I will guide you on how to slay this technology and make it bend to your will! In this session, we are going to demystify the presumed complexity of Neural Networks. No need for a PhD or mathematical background, after this overview, you will be discussing these concepts around the water cooler. There will be very little math and lots of coding. The goal is for everyone to become acquainted with Neural Network from a pragmatic standpoint. </p>\n<p>In this session, we will take a closer look at artificial neural networks inspired by biological neurons. We will study how these neurons can be modeled in a digital counterpart. After a short introduction of the actor model, the communalities between neurons and how Actors work by building an asynchronous and reactive neural network will be demonstrated.<br />\nJust when you think it couldn&#8217;t get any better, I will show you how to employ the functional paradigm to leverage multicore machines and GPUs to make your neural network predictions infinitely faster through parallelism. </p>\n<p>By the end of this talk, you will learn the basic concepts of Neural Network and how to apply functional concurrency to estimate future stock prices at smoking fast speeds…and perhaps get rich while practicing!</p>\n",
        "room": "30th Street",
        "speaker": "Riccardo Terrell",
        "badge": "MVP"
    },
    {
        "id": 15867,
        "date": "2018-03-24T10:00:19",
        "time": "10:00",
        "slug": "view-components-and-tag-helpers-in-net-core",
        "title": "View Components and Tag Helpers in .NET Core",
        "body": "<p>View Components were a new feature released as part of .NET Core MVC. They are a great way to create reuseable bits of code that are accessible in your MVC applications. I will walk you through code to create a View Component in an external library and consume it using the Tag Helper syntax in an MVC application.</p>\n",
        "room": "Merion",
        "speaker": "Anna Bateman",
        "badge": ""
    },
    {
        "id": 15872,
        "date": "2018-03-24T10:00:19",
        "time": "10:00",
        "slug": "fault-driven-development",
        "title": "Fault Driven Development",
        "body": "<p>Failure IS an option! Developing cloud-first applications can be fundamentally different than building traditional on-prem applications. As a cloud app developer, you need to be prepared for and expect failures in your code as well as in your app environment. This session will arm you with tools to be proactive with fault tolerance and reactive with fault handling.</p>\n",
        "room": "Strafford",
        "speaker": "Josh Garverick",
        "badge": "MVP"
    },
    {
        "id": 15811,
        "date": "2018-03-24T10:00:09",
        "time": "10:00",
        "slug": "the-server-is-dead-going-serverless-to-create-a-highly-scalable-application-you-can-manage",
        "title": "The Server is Dead! Going Serverless to Create a Highly Scalable Application You Can Manage",
        "body": "<p>The Server is Dead! Going Serverless to Create a Highly Scalable Application You Can Manage</p>\n",
        "room": "Wynnewood",
        "speaker": "Chris Love",
        "badge": "MVP"
    },
    {
        "id": 15820,
        "date": "2018-03-24T08:30:56",
        "time": "08:30",
        "slug": "advice-for-new-developers",
        "title": "Advice for New Developers",
        "body": "<p>In this session, I&#8217;ll give the advice that will help you in the working world as a software developer. </p>\n<p>As someone who has led development teams, and been responsible for hiring and mentoring junior developers for many years, I can tell you the things that I wish you knew before you started. I can tell you the things that make me regret hiring you. I can tell you the things that make me happy I hired you. You&#8217;ll get straight talk from your manager&#8217;s perspective.</p>\n<p>Not only that, but obviously I&#8217;ve been that new developer too, and I&#8217;ve learned many lessons the hard way. Maybe something I say can save you some trouble down the line.</p>\n",
        "room": "Strafford",
        "speaker": "Travis Laborde",
        "badge": ""
    },
    {
        "id": 15842,
        "date": "2018-03-24T08:30:41",
        "time": "08:30",
        "slug": "writing-the-next-great-tech-book",
        "title": "Writing the Next Great Tech Book",
        "body": "<p>You have an idea for the next great technical book. Maybe you&#8217;re excited about a new technology that nobody&#8217;s written about yet. Maybe you&#8217;re unimpressed with the books that are out there on your favorite topic. Maybe writing a book is on your bucket list. This session will help your idea reach its potential as a published book. Technical publishing is an opaque process with a lot of moving parts, which can be confusing for outsiders to navigate. This session will guide you through the steps you should take to turn an idea into a proposal that a publisher will accept, and what to expect from the publishing experience.</p>\n<p>Creating a great technical book takes more than a good idea. It also requires a knowledge of the market, to determine whether there&#8217;s an audience willing to buy, or whether the space is too crowded to accept new entries. Publishers vary in their approach and target markets, so you need to determine which one will provide the best chance of success. Self-publishing is an option, but carries its own risks and benefits. Doing the setup work that you may not have thought about yet will help you create a proposal that will appeal to publishers, and will also make the writing process easier.</p>\n<p>Once you have a contract with a publisher, or have decided to self-publish, it&#8217;s more than just a matter of putting the words in order. Finding the right environment, setting a schedule, and communicating with your editor are all critical to success. This session will explain how the process works, highlight the parts you may not know, and give you advice on how not to get overwhelmed by your project.</p>\n",
        "room": "Cafe",
        "speaker": "Brian MacDonald",
        "badge": ""
    },
    {
        "id": 15827,
        "date": "2018-03-24T08:30:40",
        "time": "08:30",
        "slug": "intro-to-azure",
        "title": "Intro to Azure",
        "body": "<p>An introduction to Azure and the Microsoft Cloud for Developers. We&#8217;ll discuss how to use Azure VMs as well as creating apps.</p>\n",
        "room": "Envision",
        "speaker": "David Patrick",
        "badge": ""
    },
    {
        "id": 15833,
        "date": "2018-03-24T08:30:36",
        "time": "08:30",
        "slug": "fable-grappling-the-javascript-ecosystem-with-f",
        "title": "Fable: Grappling the JavaScript Ecosystem with F#",
        "body": "<p>You can do *anything* with JavaScript, from web applications to artificial intelligence.<br />\nThat said, not all of us love working in a weakly-typed dynamic language.</p>\n<p>Fable is a free and open-source tool that can solve not only these pains but further fulfill the desire to write full-stack web and mobile applications in a single language while sharing code across platforms.</p>\n<p>In this session, be prepared for a head-first overview of F#, how to compile it to JavaScript, and learn about how real businesses use F# to create full-stack mobile and web applications powered by Fable. You&#8217;ll walk away with concrete next steps any road of success Fable can lead you on.</p>\n",
        "room": "Malvern",
        "speaker": "Stachu Korick",
        "badge": ""
    },
    {
        "id": 15825,
        "date": "2018-03-24T08:30:29",
        "time": "08:30",
        "slug": "filtered-sorted-paginated-grids-with-dotnetcore-angular-5-and-ag-grid",
        "title": "Filtered/Sorted/Paginated Grids with DotNetCore, Angular 5, and ag-grid",
        "body": "<p>Every custom corporate app needs grids and tables to allow users to quickly view, sort, and filter large data sets. Traditionally these are labor intensive for developers, even when using third party plugins. Brian will demonstrate techniques for building responsive high-performance grids leveraging the latest versions of C# .NET Core Framework, ASP .NET Core, EntityFramework Core, Angular, and open source tool ag-grid.</p>\n",
        "room": "Berwyn",
        "speaker": "Brian Woelfel",
        "badge": ""
    },
    {
        "id": 15809,
        "date": "2018-03-24T08:30:24",
        "time": "08:30",
        "slug": "the-future-of-c",
        "title": "The Future of C#",
        "body": "<p>It&#8217;s an exciting time to be a C# developer! C# is now open source with a modern compiler which makes it easier and quicker than ever before to extend the language. In this session, we&#8217;ll review recently released C# 7.x features, demonstrate what&#8217;s scheduled for the next release, and explore the concepts under consideration for future major milestones.</p>\n",
        "room": "MPR II",
        "speaker": "Scott Kay",
        "badge": ""
    },
    {
        "id": 15849,
        "date": "2018-03-24T08:30:20",
        "time": "08:30",
        "slug": "are-you-really-doing-microservices",
        "title": "Are you really doing microservices?",
        "body": "<p>Microservices aren&#8217;t small services. A microservice architecture is a very different approach to building applications. If you&#8217;ve done web services or WCF services or Web API REST services then you know what services are and you&#8217;re ready to take the next step and see how large applications are designed in a manageable way with a microservices architecture. Examples will be shown using Azure SQL Database, Cosmos DB, .NET Core, Azure functions and a variety of UIs. Come ready to see application development in a cool new way.</p>\n",
        "room": "30th Street",
        "speaker": "Mike Yeager",
        "badge": ""
    },
    {
        "id": 15835,
        "date": "2018-03-24T08:30:08",
        "time": "08:30",
        "slug": "introduction-to-kubernetes-with-azure-container-service-aks",
        "title": "Introduction to Kubernetes with Azure Container Service (AKS)",
        "body": "<p>The recent release of AKS, the newest version of managed Kubernetes services for Microsoft Azure, allows developers to quickly realize the benefits of open source Kubernetes without the complexity and operational overhead of getting it up and running. In this presentation we will explore Kubernetes fundamentals and demonstrate standing up a Kubernetes Cluster from within the Azure Portal and from the CLI.</p>\n",
        "room": "Paoli",
        "speaker": "Jason van Brackel",
        "badge": ""
    },
    {
        "id": 15813,
        "date": "2018-03-24T08:30:06",
        "time": "08:30",
        "slug": "getting-started-with-entity-framework-core-2",
        "title": "Getting started with Entity Framework Core",
        "body": "<p>With the cross-platform version of .Net, Microsoft has had to rewrite many of the core components that we have come to depend on. If you include data in your applications, chances are you have used Entity Framework in the past. In this session, you&#8217;ll learn how to get started using EF Core and how to handle the changes in this version.</p>\n",
        "room": "Merion",
        "speaker": "Jim Wooley",
        "badge": "MVP"
    },
    {
        "id": 15807,
        "date": "2018-03-24T08:30:04",
        "time": "08:30",
        "slug": "vue-vuetify-vuex",
        "title": "Vue + Vuetify + Vuex",
        "body": "<p>Vue is gaining a lot of buzz as a worthy alternative to React and Angular in the JavaScript UI framework market. Come see how this fast and lightweight competitor simplifies SPA development chores. Vuetify is a popular implementation of Material Design principles that seamlessly snaps into a Vue app for a modern responsive look and feel. Vuex provides store and state management using Flux architecture patterns.</p>\n",
        "room": "MPR I",
        "speaker": "Bill Wolff",
        "badge": "MVP"
    },
    {
        "id": 15847,
        "date": "2018-03-24T08:30:02",
        "time": "08:30",
        "slug": "zero-to-devops-with-vsts",
        "title": "Zero to DevOps (with VSTS)",
        "body": "<p>DevOps is the secret sauce behind today&#8217;s most successful development teams and companies. Join Microsoft Cloud Solutions Architect Louis Berman as he shows you how to speed your race into the cloud; in many cases by as much as 10x within a single year. In this demo-heavy session Mr. Berman will demonstrate how very easy it is for every organization to adopt DevOps, but just as importantly he’ll also focus on the soft-skills needed to “sell” DevOps to your clients and peers. The session will conclude with Mr. Berman’s “Top 10 Tips for DevOps Success!”</p>\n",
        "room": "Wynnewood",
        "speaker": "Louis Berman",
        "badge": "MS"
    },
    {
        "id": 15785,
        "date": "2018-03-23T08:30:50",
        "time": "08:30",
        "slug": "contain-your-enthusiasm-kubernetes-hands-on",
        "title": "Contain Your Enthusiasm: Kubernetes Hands-On",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>The recent release of AKS, the newest version of managed Kubernetes services for Microsoft Azure, allows developers to quickly realize the benefits of open source Kubernetes without the complexity and operational overhead of getting it up and running. In this presentation you will learn:</p>\n<p>* A quick history lesson on containers and the Docker engine.<br />\n* Kubernetes and Docker fundamentals.<br />\n* To author Docker containers from source code.<br />\n* Standing up a Kubernetes Cluster from within the Azure Portal and from the CLI. We&#8217;ll look at both Windows Server Containers and Linux-Based Docker Containers.<br />\n* Navigating the Kubernetes UI<br />\n* Deploying and scaling applications within your cluster.<br />\n* Managing configuration and secrets within your cluster.<br />\n* A few bonus topics as time permits.</p>\n<p>You&#8217;ll need a laptop running Windows 10, Docker for Windows installed and an Azure Account. Microsoft is currently offering $200 of Azure credit for free, find out more here. https://azure.microsoft.com/en-us/</p>\n<p>Get Docker here https://store.docker.com/editions/community/docker-ce-desktop-windows</p>\n",
        "room": null,
        "speaker": "Jason van Brackel",
        "badge": ""
    },
    {
        "id": 15770,
        "date": "2018-03-23T08:30:50",
        "time": "08:30",
        "slug": "get-ready-to-develop-apps-for-ultra-modern-businesses",
        "title": "Get ready to develop apps for ultra-modern businesses",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>Microservices aren&#8217;t just small services. A microservice architecture is a very different approach to building applications. In this hands-on lab we&#8217;ll build the data and services layers as well as server-less features for an ultra-modern business plan and marry them to pre-built web and mobile apps for an end-to-end example that demonstrates how apps are now being built. This is not the architecture you’re accustomed to!</p>\n<p>You&#8217;ll need an Azure subscription, so sign up for a free trial on Thursday if you don&#8217;t already have one. We&#8217;re also going to use Visual Studio 2017 with at least the &#8220;ASP.NET and web development&#8221;, &#8220;Azure development&#8221;, &#8220;Data storage and processing&#8221; and &#8220;.NET Core cross-platform development&#8221; workloads installed. The &#8220;Mobile development with .NET&#8221; workload is optional. The free Community Edition is fine. If you are running Windows 10 Pro or above and want to use Docker containers for the lab, please install the latest Docker For Windows from https://docs.docker.com/docker-for-windows/install/ as well.</p>\n",
        "room": null,
        "speaker": "Mike Yeager",
        "badge": ""
    },
    {
        "id": 15787,
        "date": "2018-03-23T08:30:47",
        "time": "08:30",
        "slug": "react-vs-angular-vs-vue",
        "title": "React vs Angular vs Vue",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>This hands-on lab covers the three most popular JavaScript UI frameworks. Learn the fundamentals of React from Facebook, Angular from Google, and the new guy called Vue. </p>\n<p>Part 1: bootstrapping, component definition, markup syntax, and file structures<br />\nPart 2: component communication and routing<br />\nPart 3: data services, Flux architecture (Redux, Vuex) , and providers<br />\nPart 4: Visual Studio Code tooling, Typescript, CLIs, browser add-ons, and Material Design</p>\n<p>We develop the the same single page application in all three frameworks while carefully calling out similarities and differences.</p>\n",
        "room": null,
        "speaker": "Bill Wolff",
        "badge": "MVP"
    },
    {
        "id": 15986,
        "date": "2018-03-23T08:30:40",
        "time": "08:30",
        "slug": "sql-server-for-the-non-database-administrator",
        "title": "SQL Server for the Non Database Administrator",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>In this all day workshop on Microsoft SQL Server we will be learning about how Microsoft SQL Server works and what needs to be done to keep it up and running smoothly when you don&#8217;t have a full time database administrator on staff to help you keep it running.</p>\n<p>In this workshop we will cover a variety of topics including backups, upgrade paths, indexing, database maintenance, database corruption, patching, virtualization, disk configurations, high availability, database security, database mail, anti-viruses, scheduled jobs, and much, much more.</p>\n<p>After taking this full day session on SQL Server you&#8217;ll be prepared to take the information that we go over and get back to the office, get the SQL Server&#8217;s patched and properly configured so that they run without giving you problems for years to come.</p>\n<p>You will learn:</p>\n<p>Backups<br />\nRecovery<br />\nCorruption<br />\nIndexing</p>\n",
        "room": "30th Street",
        "speaker": "Joseph Dantoni",
        "badge": "MVP"
    },
    {
        "id": 15776,
        "date": "2018-03-23T08:30:39",
        "time": "08:30",
        "slug": "xamarin-forms-bootcamp",
        "title": "Xamarin.Forms Bootcamp",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>This is an all day workshop showing the ins and outs of Xamarin.Forms, a wonderful framework from Microsoft for building cross platform applications. We will be building an Android app together. The basic topics that will be covered include:</p>\n<p>&#8211; Xamarin.Forms Controls and XAML<br />\n&#8211; Authentication using both JWT and also Xamarin.Auth<br />\n&#8211; Navigation in Xamarin.Forms<br />\n&#8211; Local databases with SQLite</p>\n<p>To code along, please bring a laptop with Visual Studio installed (either Windows 10 or Mac OSX.) To test the application locally, it&#8217;s recommended to install Android Studio as well for the SDK tools and emulators. You can also use an Android phone connected via USB in developer mode. I will be providing a RESTful API we will use for our application.</p>\n<p>If time permits, these advanced topics can be covered:</p>\n<p>&#8211; XAML design using Live Player or Gorilla Player<br />\n&#8211; iOS development (with Unified API)<br />\n&#8211; Animations (using AirBnb&#8217;s Lottie library)<br />\n&#8211; Continuous integration using Jenkins<br />\n&#8211; Incorporating an Android widget into the app</p>\n",
        "room": null,
        "speaker": "Mike Melusky",
        "badge": ""
    },
    {
        "id": 15778,
        "date": "2018-03-23T08:30:39",
        "time": "08:30",
        "slug": "powershell-primer-2",
        "title": "PowerShell Primer",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>Whether you&#8217;re an ITPro or a Developer, this workshop is designed to give you real world experience learning PowerShell in depth.</p>\n<p>This PowerShell Workshop is presented by 9 time Microsoft Award recipient Doug Finke and author of &#8220;PowerShell For Developers&#8221;, magazine articles (MSDN, Dr. Dobb&#8217;s, PowerShell Magazine, Microsoft&#8217;s Hey Scripting Guys, and Net Tuts+) and numerous PowerShell blog posts.</p>\n<p>PowerShell is a key technology in Microsoft‘s strategy for automation and DevOps. Enabling agility, automation at scale and is fundamental to continuous delivery of your companies software and services.</p>\n<p>Consider this:</p>\n<p>* How long would it take your organization to deploy a change that involves a single line of code?<br />\n* Do you do this on a repeatable, reliable basis?<br />\n* What if you automated all the error prone steps in your day to day job? Could you get done faster?</p>\n<p>The time from deciding that you need to make a change to having it in production is called cycle time.</p>\n<p>Come learn how PowerShell makes this happen.</p>\n<p>You&#8217;ll Learn</p>\n<p>* Core PowerShell<br />\n* Functions, Scripts and Modules<br />\n* Flow &#038; Control<br />\n* Serverless PowerShell and Azure Functions<br />\n* Tool Making in PowerShell<br />\n* PowerShell v6.0</p>\n",
        "room": null,
        "speaker": "Doug Finke",
        "badge": "MVP"
    },
    {
        "id": 15772,
        "date": "2018-03-23T08:30:35",
        "time": "08:30",
        "slug": "progressive-web-apps-from-beginner-to-expert",
        "title": "Progressive Web Apps From Beginner to Expert",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>Progressive Web Apps are the hot thing for 2018. They use the best web architecture and APIs to provide the best user experiences. All browsers, including Chrome, Edge, FireFox, Safari, Opera and Samsung Internet have added or are in the process of adding progressive web application support. This makes PWAs a ubiquitous solution for engaging applications.<br />\nPWAs utilize new technologies like service worker caching, background sync and deep platform integrations like push notifications. But most developers have little to no experience writing service workers and architecting effective caching.</p>\n<p>In this workshop we will create a new application that implements the baseline progressive web application requirements. The majority of the day will focus on implementing effective service worker caching strategies in the application.<br />\nTime permitting you will also learn how to add native push notifications to your web application.</p>\n",
        "room": null,
        "speaker": "Chris Love",
        "badge": "MVP"
    },
    {
        "id": 15780,
        "date": "2018-03-23T08:30:35",
        "time": "08:30",
        "slug": "improving-code-quality-with-roslyn-code-analyzers",
        "title": "Improving code quality with Roslyn Code Analyzers",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>The new .Net compliers in Visual Studio 2015 include the ability to expose the language services to allow developers to build their own analyzers and code fixes/refactorings. In this session we&#8217;ll introduce you to the capabilities of the compiler platform and demonstrate how we can extend it to more proactively catch common coding smells and patterns that would have otherwise caused runtime exceptions that can be caught during compilation instead. If you&#8217;ve relied on third party commercial coding tools like resharper in the past, you&#8217;ll see how you can build your own tooling extensions or leverage some of the many open source solutions.</p>\n",
        "room": null,
        "speaker": "Jim Wooley",
        "badge": "MVP"
    },
    {
        "id": 15774,
        "date": "2018-03-23T08:30:02",
        "time": "08:30",
        "slug": "modern-patterns-of-concurrent-and-parallel-programming-in-net",
        "title": "Modern patterns of concurrent and parallel programming in .NET",
        "body": "<p><a style=\"float: right; display: inline-block; background-color: darkred; color: white; border-radius: 10px; padding: 10px; cursor: pointer; text-decoration: none; font-size: large; font-weight: bold; line-height: 10px; margin-left:15px;\" href=\"#\">Sold Out</a>Become the master of the multicore domain. Learn how to harness the powers of parallel computation and multicore computation to dominate peer applications in finance software, video games, web applications and market analysis. To yield the most performance, computer programmers have to partition and divide computations to maximize the performance while taking full advantage of multicore processors. Start your path from Padawan to Jedi, after this workshop you will be ready to return to work and have code bend to your will. </p>\n<p>Concurrency, multi-core parallelism, and distributed parallelism are powerful and accessible. These computing concepts promise big impacts on the full spectrum of software applications, including video games, web applications and market analytics suites. Programmers of these products know how to partition computations over large distributed datasets in order to take full advantage of modern hardware and computing environments. These programming skills are not easy to master. This course will introduce technologies and tools available to developers at every level who are interested in achieving high-performance, reliable and maintainable code through functional-style parallelism and concurrency.</p>\n<p>We are facing a new era of geographically-distributed, highly-available systems with processor designs that are scaling out in core counts quicker than they are scaling up in core speeds. In keeping up with performance expectations as complexities and dataset grow, scaling out software architectures over these modern computing resources is one of the biggest challenges facing developers today. </p>\n<p>This course will introduce you to technologies and tools available to developers at every level who are interested in achieving exceptional performance in applications. You will gain an insight into the best practices necessary to build concurrent and scalable programs in .NET using the functional paradigm, which covers OnPrem and Cloud based applications.</p>\n<p>Notes and comments<br />\nThe following objectives will be satisfied during the duration of the course:</p>\n<p>1.\tFunctional Programming Techniques for Concurrency<br />\n2.\tBuilding high-performance concurrent systems<br />\n3.\tImplementing high-volume real-time event stream processing<br />\n4.\tImplementing concurrent patterns such as divide-and-conquer, fork/join, producer-consumer, Map-Reduce, pipeline and more<br />\n5.\tAsynchronous Functional Combinators<br />\n6.\tApplying Reactive Programming Everywhere with Agents and Actors<br />\n7.\tHow to develop applications that scale up &#038; out using the same programming model (Agents and/or Actors)</p>\n<p>Target Audience<br />\nAny developer who want to improve their skills and employ polyglot techniques to solve concurrent problems</p>\n<p>Prerequisite<br />\nThe preferred audience for this course is as follows:<br />\n&#8211; Developer with 2-3 years&#8217; experience and/or architect.<br />\n&#8211; Basic knowledge a programming language, recommended either C# or F#<br />\n&#8211; No experience in functional programming is necessary<br />\n&#8211; Developers who want to improve their skills and employ polyglot techniques to solve problems.</p>\n",
        "room": null,
        "speaker": "Riccardo Terrell",
        "badge": "MVP"
    }
]